[{"title":"Helping Your Pastor","body_content":"Recently I was asked to give a few ways that members of a congregation could help their pastor besides the obvious one of prayer. The individual was not trying to minimize the need for prayer, but instead realized that prayer is not enough. Real support is found not only in praying for but actively working with your pastor. As a result several different things have come to mind as excellent ways to encourage, edify, and strengthen a pastor’s ministry.\n\nFirst, demonstrate a sincere desire to hear the sermon. Many would say that they already do this, but I feel that most don’t understand what real hearing means. This does not mean that the congregation should merely listen to the sermon, but that once they have heard they demonstrate understanding by applying the delivered Word. Don’t tell the pastor “thanks, I appreciate that” instead tell him how that message applied to you. This will not only let him know that he is being effective, but it will also help him to know your specific needs and thus he is better able to meet them as a result. Too often we are content to express thanks as an obligation when we leave, instead we should express our need so that the pastor can more earnestly pray for each of us.\n\nSecond, please take correction as edification instead of as an attack. Part of the pastor’s job is to help each member become more like Christ, as a result he must do more than just encourage good behavior. He must also reveal when an action or pattern of behavior is destructive and counter productive to the cause of Christ. I realize that many pastors may not correct with the appropriate attitude, but consider how your attitude may affect his. If you begin with a strong defensive wall, he will probably respond with the same. I realize that this is difficult, but ultimately our spiritual maturity can be measured by our response to correction. Even if he doesn’t have an appropriate attitude, he may have a valid concern. Listen to what is said with a spirit of submission to Christ (not the pastor), and understand that God’s refining process is difficult. Interestingly, I feel that this is doubly important if his attitude is wrong, because then you must respond with humility in order to allow for God’s corrective hand.\n\nThird, please learn to handle personality conflicts and small problems yourself. As a pastor, I have had to be distracted from my primary ministry on many Sundays in order to deal with petty conflict issues. Learn to say “I was wrong, please forgive me”, or learn to forgive. Nothing divides more quickly than conflict. If you have a problem with someone try to work it out with them before you bring the pastor into it.\n\nFourth, don’t volunteer to help. I know that sounds a little strange, but let me explain. Too often I have been told by individuals that they are willing to help, but then they never volunteer to help in the areas that need help. If you want to help with a certain ministry or in a certain area then ask, but don’t be nebulous or vague. Your pastor may or may not know what you strengths or weaknesses are, help him out and let him know. If he asks you to do something that you are unable to do, then tell him so. Don’t agree to do it and then do nothing with it. Also, don’t suggest an activity or ministry be started unless you are prepared to take a leadership role in either it’s organization or operation. Your pastor probably already is involved in more ministries than he should be so take the time to consider your role in it before you suggest it.\n\nFifth, increasing the amount of money he receives is not the answer. If the pastor is a man of integrity there is a limit to what he is able to receive in good conscience. In addition, the more he is paid the greater his sense of obligation will be for him to work harder. For the pastor this can be destructive. He is probably already straining the bounds of sanity and sleep. Understand that he works more than you probably realize. Even if he doesn’t spend all day in the office, he probably works from home. Unlike many professions, he has no personal space. I do most of my studying at home where I have great resources and fewer distractions. It is not unusual for a pastor to be studying late into the evening, to be interrupted by emergency phone calls, to have impromptu counseling sessions, and to comfort the suffering in any given week. These can’t all be planned, please understand that.\n\nSixth, your pastor will need you to correct him just as you need him to correct you. Please correct him with the same attitude you would want to be corrected with. It is easy to either ignore or overlook or overreact to a pastor’s mistakes or sins, but we cannot allow that to happen. If you fail to correct your pastor then your pastor may become arrogant or proud. In addition his sin could escalate into one that would be a massive devastation to the church. He should be corrected with meekness and humility, which should then make a positive response more likely. Understand that no correction is pleasant, but it is necessary. Also correction is needed if he said or taught something in error. This correction will reveal to him several things. It provides humility to him by providing an opportunity to apologize and correct the sin or error publicly. It provides encouragement concerning the discernment of the congregation revealing to him that they are learning and maturing. It provides transparency between the congregation and the pastor. It provides unity by helping everyone realize that we each are the same and have the same need for Christ’s grace in all situations.\n\nSeventh, give your pastor encouraging notes once in a while at a time other than the Sunday service. When you do this don’t make it a phone call or a text message. This should be something personal and something that took time. The pastor spends a great deal of time providing spiritual nourishment for the church, and a return of time is appreciated. This should be at least an email, but is better if it is a letter or card. If you choose to send a card please write something meaningful in it. This is something that the pastor will keep and remember. I know that many churches practice a “pastor appreciation” month in October, but this is something that should happen throughout the year and not at a regular time.\n\nFinally, please respect his time on service days. Many feel that the best time to have a quick conference with the pastor is either before or following a service. This is the worst time, not the best. There are five other days that could be used. Please understand that the pastor has other things on his mind, he is exhausted from having just poured out his heart and spirit for the last hour, or may have another previously scheduled meeting. If you have a quick question a quick email, text, or phone call will normally fit more easily into his schedule. Don’t assume your five minutes will truly be five minutes. If it is an emergency, then by all means speak to him, but if it can wait schedule a time to discuss it with him. This will be to your advantage as well as his, because he will be able to give you more focus and thus provide better counsel and advice. Likewise, please respect his day off. He needs the time to be able to focus on rest and his family. If you don’t know when his day off is, ask.\n\nThis list is by far not an exhaustive one, but is intended only as a general list to provide some ideas. The key is to remember that if you are exhausted by your efforts with the church, then he probably is too. Remember that he hurts too, he struggles too, he needs gracious correction too, and he needs love too.","categories":["Articles"],"author":["rec8A0tWhaGdNqO50"],"date_added":"2016-02-13","published":true,"author_name":["Pastor David Bousquet"],"author_thumbnail":[{"id":"attZ5clmn6QhITAYD","url":"https://dl.airtable.com/BaLMuRfQbK5QHvVgntv1_bousquet.jpg","filename":"bousquet.jpg","type":"image/jpeg","size":12302,"width":256,"height":256,"smallThumbUrl":"https://dl.airtable.com/HitcmenQxewc3cpUKqma_small_bousquet.jpg","smallThumbWidth":36,"smallThumbHeight":36,"largeThumbUrl":"https://dl.airtable.com/wXcRpTUQ5izHDk7fIVoD_large_bousquet.jpg","largeThumbWidth":256,"largeThumbHeight":256}],"ten_minutes":0,"updated_or_created_ten_minutes":0},{"title":"The Word was Made Flesh","body_content":"> *“And the Word was made flesh, and dwelt among us, (and we beheld his glory, the glory as of the only begotten of the Father,) full of grace and truth.”*\n\nAs Christmas approaches and we finalize our shopping and baking it is essential that we take some time to recognize several wonderful elements of this verse. First, the Word was made flesh. Think of the wonder of this phrase. The Word of God, the Son, was made flesh. Emmanuel was born. God with us. Not just another baby, not just another boy, it was God himself wrapped in human flesh who was born. God choosing to dwell with his own rebellious creation. God humbling himself to be cared for by frail humans, who could not begin to comprehend the fullness of who he was. God becoming not only involved, but becoming a part of the very people that he desired to save. We see love and tenderness. We see hope and joy.\n\nSecond, this verse says that he would dwell among us. He did not come for a moment, but for a life. He came to connect personally with mankind. He came to experience our frailty and our temptations. He came to endure pain, suffering, and infirmity. He came to dwell with us, so that we would be able to dwell with him.\n\nThird, the glory of God was beheld by man. Moses wanted to see the full glory of God, but was only allowed to get a glimpse. The glory of the Lord filled the Holy of Holies. Man finally was given the opportunity to see the glory of God without fear of death, because Christ dwelt with man. God was in the presence of man without the need for a sacrifice or an intercessor.\n\nFinally, he was full of grace and truth. His holiness and his mercy were full and seen and experienced by man. We were able to see that fulfillment of the Law was accomplished, and that a way was opened up to have direct access to God through the grace of Christ. Praise God for the fullness of grace and truth.","categories":["Articles"],"author":["rec8A0tWhaGdNqO50"],"date_added":"2015-12-23","published":true,"author_name":["Pastor David Bousquet"],"author_thumbnail":[{"id":"attZ5clmn6QhITAYD","url":"https://dl.airtable.com/BaLMuRfQbK5QHvVgntv1_bousquet.jpg","filename":"bousquet.jpg","type":"image/jpeg","size":12302,"width":256,"height":256,"smallThumbUrl":"https://dl.airtable.com/HitcmenQxewc3cpUKqma_small_bousquet.jpg","smallThumbWidth":36,"smallThumbHeight":36,"largeThumbUrl":"https://dl.airtable.com/wXcRpTUQ5izHDk7fIVoD_large_bousquet.jpg","largeThumbWidth":256,"largeThumbHeight":256}],"ten_minutes":0,"updated_or_created_ten_minutes":0},{"title":"Pray without Ceasing","body_content":"Thomas Jackson was asked about I Thessalonians 5:17 which commands the believer to pray without ceasing. His response was that he could no more forget to pray than he could forget to eat when hungry or to drink when thirsty. He also stated that to pray without ceasing results in taking advantage of each opportunity as a chance to commune with Almighty God. He said that he would pray for the intended recipient of a letter that the letter would be a blessing, he would pray for the safety of the postman who would face the inclement weather to deliver the letter, he would pray for the cadets as he passed them in review, and he would pray for his fellow teachers that they would instruct in more than just their classes.\n\nWhat a wonderful way to illustrate the concept of continual prayer. We are called to be in constant fellowship with our Heavenly Father, and to routinely praise Him throughout our day. This verse is sandwiched in between of two others, which reveal the substance of our prayers. First, verse 16 says that we are to rejoice evermore. Rejoicing is to be the constant theme of our lives. James 1 points out that we are to rejoice when we face temptations, for through them we are able to grow in our faith. We should rejoice always for it is in the crucible of suffering that we are formed into the holiness of Christ.\nSecond, we are told in verse 18 to give thanks in everything for this is the will of God in Christ Jesus for us. When we experience pain, give thanks. When we argue with our spouse, give thanks. When we receive a raise at work, give thanks. When we are picking up spilled coffee, give thanks. In everything give thanks. This requires us to recognize that everything that God allows in our life is meant to be an opportunity for us to worship Him as well as an opportunity to become more like Him.\n\nIf we would practice these two elements, then continuous prayer would become a reality. We would be in constant communication with the Father, seeking His favor for others, and seeking His help to face situations in a way that is glorifying to Him.","categories":["Articles"],"author":["rec8A0tWhaGdNqO50"],"date_added":"2015-11-06","published":true,"author_name":["Pastor David Bousquet"],"author_thumbnail":[{"id":"attZ5clmn6QhITAYD","url":"https://dl.airtable.com/BaLMuRfQbK5QHvVgntv1_bousquet.jpg","filename":"bousquet.jpg","type":"image/jpeg","size":12302,"width":256,"height":256,"smallThumbUrl":"https://dl.airtable.com/HitcmenQxewc3cpUKqma_small_bousquet.jpg","smallThumbWidth":36,"smallThumbHeight":36,"largeThumbUrl":"https://dl.airtable.com/wXcRpTUQ5izHDk7fIVoD_large_bousquet.jpg","largeThumbWidth":256,"largeThumbHeight":256}],"ten_minutes":0,"updated_or_created_ten_minutes":0},{"title":"The Need to Contend","body_content":"The book of Jude opens with the declaration that he had originally intended to write to Christians about our wonderful common salvation. He intended to write a letter of encouragement, exhortation, and peace. However, the Holy Spirit had a different message for the church. He was instead moved to write an epistle to encourage the church to contend for the faith which had been received from the saints. This is a very important thing for each of us to remember.\n\nContending for the faith is accomplished in various steps. First, it involves studying the Scriptures in order to know what the Bible teaches. The only way to keep from being lead into false doctrine is to know what the Bible teaches. We must as Christians dedicate ourselves to routine study, which seeks to integrate the Bible into our daily lives. Second, contending involves warning those who are genuinely seeking truth. It is easy to be lead astray in this world of chaos. As Christians we are called to lead others to Christ, and as such we must graciously and lovingly warn those who are desirous of truth about the false teachers that are throughout the world. The first we are to warn are those of our own homes. Our spouse, our children, our grandchildren, and our close family members need our love and guidance. The next group are those fellow Christians that we have regular contact with. This group will typically contain a mixed group of maturity. As such, those who are spiritually mature are commanded to teach and edify those who are immature. We must contend for them. The final group that we must contend for are for those who do not know the truth yet, but have seen hope demonstrated in our lives and then ask why we possess such hope. These tender individuals can be easily led astray if they are not properly directed and cherished. Thus we must contend.\n\nFinally, we must recognize that the word implies effort and battle. It is not easy to contend, but it is necessary. It will not necessarily make friends, but it will help to preserve the doctrine of the church and to live a life of distinction in this world.","categories":["Articles"],"author":["rec8A0tWhaGdNqO50"],"date_added":"2015-10-02","published":true,"author_name":["Pastor David Bousquet"],"author_thumbnail":[{"id":"attZ5clmn6QhITAYD","url":"https://dl.airtable.com/BaLMuRfQbK5QHvVgntv1_bousquet.jpg","filename":"bousquet.jpg","type":"image/jpeg","size":12302,"width":256,"height":256,"smallThumbUrl":"https://dl.airtable.com/HitcmenQxewc3cpUKqma_small_bousquet.jpg","smallThumbWidth":36,"smallThumbHeight":36,"largeThumbUrl":"https://dl.airtable.com/wXcRpTUQ5izHDk7fIVoD_large_bousquet.jpg","largeThumbWidth":256,"largeThumbHeight":256}],"ten_minutes":0,"updated_or_created_ten_minutes":0},{"title":"The Pain of Growth","body_content":"**Who enjoys pain or suffering?** The answer is no one. I remember when I was a teenager that I suffered with a common malady referred to as osgood schlatter disease. This was essentially caused by rapid growth which resulted in bones that were growing more quickly than my tendons were. The pain associated with this condition varied from slight to nearly crippling. I was then told by an orthopedic doctor that it was a part of life, and that I should grow out of it.\nSometimes growth causes pain. There is no way around it that change is often uncomfortable, and that it can result in aches and pains that need to be addressed. This idea has come to my mind today as I think about the progress on the parking lot, the growth of the church both physically and spiritually, the search for an associate pastor, and the constant need to challenge myself to meet the needs of the church. This period of growth pushes us as a church to face situations which may not be comfortable, but which need to be faced none the less. With an increase in the body of Christ here, so also comes an increase in the number of individuals who have hurts and struggles and are in need of healing. It is important for each of us to recognize that it also calls for an increase in personal ministry.\n\nMinistry is not reserved for those who are teaching or preaching, but instead should be understood as meeting a need. The idea often being expressed throughout the Word of God is that of a physician who has learned to not only recognize a need, but also seeks to alleviate the suffering caused by the need. As such each believer is called to function as a minister within the local church, for each is empowered by the Holy Spirit with unique gifts and talents to strengthen and edify the body of Christ. Ministry can be as simple as sending a card to a hurting individual or scrubbing a toilet. It is accomplished not only with the action, but with a heart dedicated to service to Christ. The single greatest requirement for a minister is humility. This is due to the nature of humility, which sees others as being important and worth the effort to encourage and assist.\n\nIn those times of growth realize that pain is often present, but we labor for a healthier and stronger body, which will be able to more effectively minister to the community the love of Christ. Patience and humility when combined with the understanding of God’s purpose will bring about a church that is both glorifying to God and unified together.","categories":["Articles"],"author":["rec8A0tWhaGdNqO50"],"date_added":"2015-09-22","published":true,"author_name":["Pastor David Bousquet"],"author_thumbnail":[{"id":"attZ5clmn6QhITAYD","url":"https://dl.airtable.com/BaLMuRfQbK5QHvVgntv1_bousquet.jpg","filename":"bousquet.jpg","type":"image/jpeg","size":12302,"width":256,"height":256,"smallThumbUrl":"https://dl.airtable.com/HitcmenQxewc3cpUKqma_small_bousquet.jpg","smallThumbWidth":36,"smallThumbHeight":36,"largeThumbUrl":"https://dl.airtable.com/wXcRpTUQ5izHDk7fIVoD_large_bousquet.jpg","largeThumbWidth":256,"largeThumbHeight":256}],"ten_minutes":0,"updated_or_created_ten_minutes":0},{"title":"The Church At Ephesus","body_content":"I recently started a series of messages on the seven churches found in Revelation. It is my belief that these churches essentially provide examples of the seven major types of churches found throughout Christianity today. Some of them were strong vibrant churches that stood against heresy, while others quickly accepted false teachings and compromised the truth of God.\n\nIn Revelation 2:1-7 God gives both praise and warning to the church that was in Ephesus. He praised them for their stand against worthlessness, heresy, and self righteousness. However, He had “somewhat” against them. He stated that they had left their first love and that they needed to return to the first works of love again. The question that I think needs to be asked is what are those first works of love?\n\nThe answer is found not in the return to the emotional joys, but instead in the act of studying with joy of discovery. When one enters into a new relationship their is typically an excitement to learn all about the other person. In the Christian life, a new believer often is overcome with excitement and a desire to learn all that they can. This fervor, however, has a tendency to die out. Study becomes a chore or worse nonexistent. God’s desire for the the Ephesian church was to return to the passionate joyful study of the truth. This turns the “chore” into an act of love and worship, because it is looking for discovery which will result in the individual conforming to the image of Christ.","categories":["Articles"],"author":["rec8A0tWhaGdNqO50"],"date_added":"2015-09-02","published":true,"author_name":["Pastor David Bousquet"],"author_thumbnail":[{"id":"attZ5clmn6QhITAYD","url":"https://dl.airtable.com/BaLMuRfQbK5QHvVgntv1_bousquet.jpg","filename":"bousquet.jpg","type":"image/jpeg","size":12302,"width":256,"height":256,"smallThumbUrl":"https://dl.airtable.com/HitcmenQxewc3cpUKqma_small_bousquet.jpg","smallThumbWidth":36,"smallThumbHeight":36,"largeThumbUrl":"https://dl.airtable.com/wXcRpTUQ5izHDk7fIVoD_large_bousquet.jpg","largeThumbWidth":256,"largeThumbHeight":256}],"ten_minutes":0,"updated_or_created_ten_minutes":0},{"title":"How to Handle Anger","body_content":"James 1:19 says that we are to be swift to hear, slow to speak, slow to wrath. The result of following this verse is seen in the next, which says that the wrath of man does not work the righteousness of God. Anger is an emotion which is filled with potential for both good and evil. In its profitable sense, anger is meant to provide the emotional fuel to move an individual to stand up against injustice, to protect loved ones from danger, and to guard the path of individual holiness. However, when it is abused it results in the destruction of the individual’s testimony and potentially family.\n\nThe way to handle this anger is to recognize that there are several steps in order to manage anger. First, the individual needs to be swift to hear. This literally means that the individual needs to live to listen to the other individual. It is fairly easy to recognize when someone is actively listening to you. Active listening means that the individual is listening with the intent to apply the gained knowledge to the situation. This shows concern for the other and gives a great opportunity demonstrate concern for the other individual. In addition, being swift to hear requires the individual to listen to the words and not to the tone that is used. It listens to detect if the other has been hurt, or what the other’s motivation may be. Thus swift to hear listens to the whole individual and not only to the anger.\n\nSlow to speak means that the individual once he has listened will then carefully choose his words and his tone. He does not say the first thing that comes to his mind, but instead strives to use words that are going to be constructive in the situation. He realizes that words have power, and that if he has been listening then he will be able to check his own emotional response to the situation. His words then should focus on healing the situation.\n\nThe final step is to be slow to wrath. This occurs when the individual is able to focus his anger not at the other individual, but instead at the problem. We should not be angry at a person, but instead at a problem. As Christians we are called to love each other, and thus our anger needs to be guided by a sense of love for the other. This allows for a much easier response on the part of the other. If anger is focused at the individual instead of the problem, then forgiveness and healing will be delayed for the problem is not dealt with. When the anger is focused at the problem, which can be both words and actions, then the other is more willing to help fix the situation because he does not feel specifically targeted. This is like dealing with a tumor. Typically the doctors first focus on trying to eliminate the tumor through targeted surgery. Anger is meant to be a specific targeted surgery for a problem. When these concepts are remembered and employed, they will help guide our responses to others, and should aid us in controlling our anger.","categories":["Articles"],"author":["rec8A0tWhaGdNqO50"],"date_added":"2015-05-14","published":true,"author_name":["Pastor David Bousquet"],"author_thumbnail":[{"id":"attZ5clmn6QhITAYD","url":"https://dl.airtable.com/BaLMuRfQbK5QHvVgntv1_bousquet.jpg","filename":"bousquet.jpg","type":"image/jpeg","size":12302,"width":256,"height":256,"smallThumbUrl":"https://dl.airtable.com/HitcmenQxewc3cpUKqma_small_bousquet.jpg","smallThumbWidth":36,"smallThumbHeight":36,"largeThumbUrl":"https://dl.airtable.com/wXcRpTUQ5izHDk7fIVoD_large_bousquet.jpg","largeThumbWidth":256,"largeThumbHeight":256}],"ten_minutes":0,"updated_or_created_ten_minutes":0},{"title":"Relationship or Religion","body_content":"In continuing my posts about the substance of Christianity, whether it is a relationship or a religion, it is important to focus on the focus of each concept.\n\nThose who seem to hold the closest to the Christianity is a relationship format like to emphasize the individualist aspects of their “relationship”. Quite often it seems that it can be used as an excuse for several things. First, I have seen it used as an excuse for isolation. When Christianity becomes a personal relationship, then no one else is able to criticize, critique, or judge how one expresses his own relationship. After all my relationship is personal with convictions, standards, and beliefs that fit my way of life. This concept may lead to the individual withdrawing from the church and worshiping at home alone. After all, we don’t need anyone other than the Holy Spirit to teach us, right? This is in direct conflict with the teachings of the New Testament, which specifically states that we are not to forsake the assembly of ourselves together. We need to become unified through community and not isolated through individualism.\n\nSecond, the concept of isolation through relationship ends up separating the believer from needed accountability. Within the concept of a religion is the foundation of a group worshiping together, and helping each other through encouragement to live according to the common faith. The isolation and self focus of a relationship can result in the individual stagnating his spiritual growth because there is no challenge or motivation to remove sin. When we are living our Christianity alone, we can easily justify our own actions, because we have no one that we are physically accountable to. Community provides restraint and correction, which the individual relationship concept will never be able to duplicate.\n\nFinally, the isolation of the individual relationship format can easily lead to the Elijah syndrome. Remember the weary prophet proclaimed that he was the only one left serving God, but God reminded him that there were many who still were faithful in their service to Him. In other words, the relationship format easily leads one into the my spiritual path is the only real right spiritual path, therefore, I am more spiritual than anyone else attitude. A community religion combats this through mutual confession of faults and sins, which binds the group closer together while revealing the equal need for the God’s strength and help. Relationship alone leads to depression, defeat, and discouragement; while Religion provides comfort, community, encouragement, and strength.","categories":["Articles"],"author":["rec8A0tWhaGdNqO50"],"date_added":"2015-03-12","published":true,"author_name":["Pastor David Bousquet"],"author_thumbnail":[{"id":"attZ5clmn6QhITAYD","url":"https://dl.airtable.com/BaLMuRfQbK5QHvVgntv1_bousquet.jpg","filename":"bousquet.jpg","type":"image/jpeg","size":12302,"width":256,"height":256,"smallThumbUrl":"https://dl.airtable.com/HitcmenQxewc3cpUKqma_small_bousquet.jpg","smallThumbWidth":36,"smallThumbHeight":36,"largeThumbUrl":"https://dl.airtable.com/wXcRpTUQ5izHDk7fIVoD_large_bousquet.jpg","largeThumbWidth":256,"largeThumbHeight":256}],"ten_minutes":0,"updated_or_created_ten_minutes":0},{"title":"More Than A Relationship","body_content":"I will be starting a series exploring the reasons that Christianity is a religion. This post is the first in that series.\n\nIt is interesting that in the last thirty years there has been a major push to redefine exactly what Christianity is. For some it has been statements such as: “The Church is an organism instead of an organization”, or “I’m a very spiritual person”. These sentiments are meant to convey that the individual has risen from the foundational concept of the Church or religious aspect of Christianity. Perhaps one of the most destructive concepts is that Christ intended Christianity to be a relationship instead of a religion. In all actuality this concept finds its origin not in Christianity but instead in the “New Age” movement, which is sweeping the country and the Church with its message of love and unity.\n\nIn order to recognize the truth about the real definition of what Christianity is, one must first define, and recognize the implications of, the various associated terms of both relationship and religion. First, a relationship is defined as a connection between two or more persons. This is a very simple definition. A looser definition would be that a relationship exists between any two compared or connected objects. This can be explained as the relationship that a house has to the road. Its attitude (position) reveals its relationship. Finally, a relationship is also defined as a romantic or sexual connection between two individuals. In all of these definitions there is no concept of oneness or inseparability. In other words, the word merely means the attitude or connection between something, which allows each object to remain distinct. In addition, these definitions leave the individual open to form various and sundry relationships as he sees fit.\n\nSecond, a religion is defined as several things. First, it is a belief in a supernatural power who is the creator, and the system of worship that is centered around that belief. Second, it is a system of beliefs, values, and teachings based upon the teachings of a spiritual leader. Finally, it is an ideal that is passionately pursued. Thus a religion is a system that connects an individual the creator, which also has a value system given by a spiritual teacher, which is expected to be lived and pursued with zeal and passion influencing every area of the believer’s life.\n\nIt is interesting that the culmination of these definitions explain very well what a Christian is called to be. He is expected to wrap his life around the concept that God has created him, and that God has left special teachings and instructions for him in order to connect himself to God. In addition, Christianity is centered on the teachings of Christ, and is filled with commands and expectations for him. Finally in looking at this definition it is not hard to see that Christianity is a religion, pure and simple.\n\nThe question is not whether Christianity is a religion or a relationship, but why so many want to eliminate the religion in order to “have a relationship.” Perhaps the answer is more simple than expected. For some the reason is a misunderstanding of what a religion is. For instance, the definition contains the obvious concept of relationship within its parameters. Relationship is seen in connecting with the Creator, in following the teachings of a Leader, and in allowing one’s beliefs to mold one’s life. For those who just don’t understand the definition, they think that a relationship is the key and that religion is cold and relationless, when in reality relationship is important to any religion. For these the thought is that they are connecting with God; therefore, they are in a relationship and not a religion, because they see a religion as having rules to be followed in order to attain favor with God. What these fail to recognize is that their relationship is often the same as most others’ religion, because true Christianity is a religion that shows what God has done to connect with man. They still attend church, they still read their Bibles, they still try to live according to Christ’s teaching; but they have redefined their label through a lack of understanding.\n\nThe second group is far more dangerous, these are those that claim that Christ came to free man from religion, and that His desire was to facilitate a relationship with God. These individuals will often express that Christians are under grace, and thus free from the Law. They then connect the Law as religion and grace as relationship. This group has a tendency to claim that churches are too legalistic (admittedly some are), and that since Christianity is under grace they will worship how they want at home. If they do attend a church, they will often do so until the church teaches something that contradicts their lifestyle. They will then leave claiming that the church is too legalistic. In reality the issue with this group is that they want a relationship instead of religion, because they want God on their own terms. This group is especially dangerous, because they will often destroy good churches through their actions.\n\nThe final group that often makes this claim is those that do so for matters of equality. They feel that by claiming that they have a relationship, that they then have a more equal part. This is seen in those who put on hyper spiritual airs when they discuss their “relationship”. Often they do not attend churches, because there is no longer a “true church”, but instead only “man’s religious institutions”. As a result this group will form a house church, perhaps with a couple of likeminded families, which will go through various painful splits, because each “likeminded” person will end up thinking that they are more spiritual than the others. It is this group that emphasizes that Christ worshiped wherever He was, which is true; however, they fail to recognize that He also partook of the required feasts and religious activities of Judaism.\n\nThese three are the primary groups that claim the “relationship” title for their brand of Christianity. This is by no means an exhaustive compilation, but is meant to give an overview of the various reasons behind the claim. However, what should be examined more closely are the reasons that Christianity is so much more than a relationship.","categories":["Articles"],"author":["rec8A0tWhaGdNqO50"],"date_added":"2014-12-03","published":true,"author_name":["Pastor David Bousquet"],"author_thumbnail":[{"id":"attZ5clmn6QhITAYD","url":"https://dl.airtable.com/BaLMuRfQbK5QHvVgntv1_bousquet.jpg","filename":"bousquet.jpg","type":"image/jpeg","size":12302,"width":256,"height":256,"smallThumbUrl":"https://dl.airtable.com/HitcmenQxewc3cpUKqma_small_bousquet.jpg","smallThumbWidth":36,"smallThumbHeight":36,"largeThumbUrl":"https://dl.airtable.com/wXcRpTUQ5izHDk7fIVoD_large_bousquet.jpg","largeThumbWidth":256,"largeThumbHeight":256}],"ten_minutes":0,"updated_or_created_ten_minutes":0},{"title":"Big Vs. Small","body_content":"In my ministry I have been questioned about whether large churches are better or worse than small churches. This is a rather difficult question to answer for several reasons. There are plenty of small and large churches that are not worth attending, because they are not preaching the truth; likewise there are both small and large churches that are truly preaching the Word of God. Romans 15:19 gives a wonderful criteria for the worth of a church. In this verse, Paul stated that he had fully preached the Gospel of Christ throughout Asia. This phrase “fully preached” essentially has two meanings. First, that he had preached the Gospel everywhere. Second, that he had preached the full Gospel. It was not a feel good message, but a message of sin, punishment, death, sacrifice, forgiveness, and repentance. The first criteria in judging any church is whether they preach the full gospel.\n\nAs to which is better both have advantages and disadvantages. The advantages of a sound large church is the financial resources at the churches disposal. They are able to finance some amazing works. In addition, they also tend to have a great supply of physical resources such as counselors, teachers, contractors, and other workers. A final major advantage is that they have a very professional appearance. They look and sound good, because they have the resources to put together an excellent product.\n\nThe disadvantages of the larger churches is that there is very little unity or cohesiveness within the church. Often, the congregation is made up of strangers who happen to attend together. A second disadvantage is found within the first, it lacks a close family feel. A second disadvantage is that those that minister tend to be professionals instead of laymen. This may seem small, but this kind of churches advertises for a song leader, youth leader, or secretary. The end result is that the average attender not has no service, but has no area where they can serve. A final disadvantage is found in the temptation to not speak the truth. This is the one that sets mega churches apart from large churches. When the focus becomes on growing large instead of producing spiritual maturity, the church will face the temptation to either corrupt the Word of God or ignore massive elements of the Word in order to not spark controversy within the church.\n\nThe advantages of a small church are found several areas. First, there is typically no fear to preach the truth within these churches. They know that their greatest attraction is their depth in teaching the Word of God. Second, they have numerous opportunities for individual to serve. The pastor can’t do it all, and the budget does not allow for multiple salaried staff, so the congregation ends up needing to volunteer within their gifts so that the work is done. Third, this small church tends to maintain a tight family feel and thus have a more unified group. This unity and family feel results in individuals willingly come to aid others within the church in emergencies or crises.\n\nThe disadvantages of the small church are very evident as well. They tend to give an amateur presentation, because the majority of those serving are not professionals. These churches tend to have individuals who serve out of love instead of out of money. The next disadvantage is that of fewer resources. Each individual is necessary for these ministries to accomplish their work, and each dollar is stretched for maximum use. There are no extras, and so they are often unable to have as large or as polished activities due to the limited resources.\n\nThough there are many more advantages and disadvantages of each church, in my opinion the smaller church is more effective at instilling spiritual maturity, for all of the above advantages, and for one additional one. In a smaller the church, the pastor is more accessible, thus he is more likely to invest himself in personal instruction and discipleship. Combined with the other advantages this should help to create a church that is serving, loving, and growing as a body for Christ.","categories":["Articles"],"author":["rec8A0tWhaGdNqO50"],"date_added":"2014-10-10","published":true,"author_name":["Pastor David Bousquet"],"author_thumbnail":[{"id":"attZ5clmn6QhITAYD","url":"https://dl.airtable.com/BaLMuRfQbK5QHvVgntv1_bousquet.jpg","filename":"bousquet.jpg","type":"image/jpeg","size":12302,"width":256,"height":256,"smallThumbUrl":"https://dl.airtable.com/HitcmenQxewc3cpUKqma_small_bousquet.jpg","smallThumbWidth":36,"smallThumbHeight":36,"largeThumbUrl":"https://dl.airtable.com/wXcRpTUQ5izHDk7fIVoD_large_bousquet.jpg","largeThumbWidth":256,"largeThumbHeight":256}],"ten_minutes":0,"updated_or_created_ten_minutes":0},{"title":"The Need For Grace","body_content":"Recently I had a discussion with a man who was expressing his concern for those who are becoming involved in various forms of legalism. In order to address this one must first develop a proper understanding of legalism. Legalism is not the same as having standards or “rules” that govern the manner of one’s life. Those standards, convictions, and rules are more properly defined as personal expressions of holiness. Notice they are personal, they are not corporate. That is not to say that convictions and standards are not shared corporately, but that they are determined by the individual. Legalism, however, is an attempt to merit favor with God through obedience to rules and laws, as a way to Him. In addition, legalism is judging the maturity of another by one’s own standards or convictions. Now some convictions should be shared, but how some express those convictions (standards) is personal. This is what is meant by Paul’s numerous teachings about having liberty, but not using our liberty to cause another to stumble.\n\nLegalism negates the need for grace, while trapping the individual in a system of self righteousness which will only add to the distance between the individual and God. Legalism emphasizes how I can be good enough, while ignoring that I can never be good enough. It emphasizes outward appearance of holiness without revealing the inward need for God’s holiness. It says “Don’t lie!”, but ignores that without the Holy Spirit one can not know the truth. Legalism forces the individual to focus on his worth instead of his worthlessness. Legalism is a man made religion which enslaves, Christianity is a God made religion which frees. Grace is the answer.\n\nGrace begins with the premise that the individual can not achieve the holiness of God apart from God’s direct intervention. Thus, legalism and Grace are at odds with each other. Grace declares that God’s mercy functions with God’s holiness enabling Him to be gracious and forgive. Thus Grace, through Christ’s sacrifice, breaks the work of self righteousness and opens the door of the heart to the life giving righteousness of Christ. Romans 8:3 reveals that the substance of Grace is found in the victory of Christ over sin throughout His earthly life. Christ subjected Himself to continual temptation on earth, so that He could victoriously obey the Law and thus provide grace to all who would submit to Him. The simple truth is we can never be good enough, Christ was victorious, and now our need for Grace is fulfilled in Him.","categories":["Articles"],"author":["rec8A0tWhaGdNqO50"],"date_added":"2014-09-18","published":true,"author_name":["Pastor David Bousquet"],"author_thumbnail":[{"id":"attZ5clmn6QhITAYD","url":"https://dl.airtable.com/BaLMuRfQbK5QHvVgntv1_bousquet.jpg","filename":"bousquet.jpg","type":"image/jpeg","size":12302,"width":256,"height":256,"smallThumbUrl":"https://dl.airtable.com/HitcmenQxewc3cpUKqma_small_bousquet.jpg","smallThumbWidth":36,"smallThumbHeight":36,"largeThumbUrl":"https://dl.airtable.com/wXcRpTUQ5izHDk7fIVoD_large_bousquet.jpg","largeThumbWidth":256,"largeThumbHeight":256}],"ten_minutes":0,"updated_or_created_ten_minutes":0},{"title":"Holiness","body_content":"Romans chapter two outlines that the circumcision of the Jews was pointless if the heart was not in submission to Christ. This is vital to a proper understanding of holiness. A true Jew is one that is inwardly submitted, not one who is only outwardly submitted. The real issue is that of submitted holiness to God.\n\nA parallel is found in I Samuel 16:7. Samuel was told not to look upon Eliab (David’s oldest brother) as the future king, because God knew his heart. God was looking for one that would rise in the moment of need and bravely trust Him for strength while standing firm in the battle. The issue is a heart of courage willing to deny the natural desire in order to attain unto the higher ideal of God’s desire. The heart of Eliab was revealed in chapter eighteen, when Israel was faced with the challenge of Goliath. Undoubtedly, Eliab had at one time watched the sheep, surely he had practiced with the sling, he was a trained soldier. God specifically told Samuel not to look at the height of his stature, implying the Eliab was a very tall and imposing figure. However, for forty days he hid in his tent while Goliath twice daily defied the God of Israel and mock His followers. David no sooner arrived on the scene, then he hears the challenge and answers the call. True holiness requires the same kind of courage.\n\nEliab did what many of us would have done, he fled. He did what was natural, he quit. He cowered before an impossible task. Holiness is just as daunting a battle as facing the giant, and as such our flesh naturally slinks from the challenge. Coupled with holiness comes the possible derision of family members, the complaints of legalism, the exhaustion of self denial, and the hunger for starved indulgence. For this reason, it is the mature and the courageous who will stand and fight against the natural desire in order to secure personal victory. Each moment is a battle, and the price of victory is eternal submission and vigilance. It has been said that David was a man after God’s own heart. He pursued the heart of God, not out of a desire to appear holy, but instead out of a desire to be holiness. Appearance will vanish in a flash, but real substance is revealed in the fire. Be bold, be brave, and be holy.","categories":["Articles"],"author":["rec8A0tWhaGdNqO50"],"date_added":"2014-08-19","published":true,"author_name":["Pastor David Bousquet"],"author_thumbnail":[{"id":"attZ5clmn6QhITAYD","url":"https://dl.airtable.com/BaLMuRfQbK5QHvVgntv1_bousquet.jpg","filename":"bousquet.jpg","type":"image/jpeg","size":12302,"width":256,"height":256,"smallThumbUrl":"https://dl.airtable.com/HitcmenQxewc3cpUKqma_small_bousquet.jpg","smallThumbWidth":36,"smallThumbHeight":36,"largeThumbUrl":"https://dl.airtable.com/wXcRpTUQ5izHDk7fIVoD_large_bousquet.jpg","largeThumbWidth":256,"largeThumbHeight":256}],"ten_minutes":0,"updated_or_created_ten_minutes":0},{"title":"The Need for Solitude","body_content":"Multiple times throughout His ministry, Christ went alone to pray. He would often retreat to a remote location, and then spend time praying to His Father. It was at one of these times in the garden that He revealed that His personal will was not to die, but that in spite of His desire He was fully committed to following the Father’s plan.\n\nSolitude is one of the most neglected and misunderstood steps of maturity in the life of the believer. It is neglected by the simple fullness or busyness of our lives. We fill each moment with activity, clinging to our noise as if it were a source of life. Seldom do we create an atmosphere of serene peace or solitude. We live in chaos, and seem to feel that chaos is necessary. Paul told the Corinthian church that all things are to be done decently and in order. Chaos and active serve as distractions which prevent us from really growing in our faith.\n\nNot only is it neglected, but it is also misunderstood. Solitude is not just being alone, it is creating a space and time to free oneself from the distractions of life in order to prayerfully examine one’s own heart and life with Christ. It is meant to provide the believer with an invaluable tool which in the hand of the indwelling Holy Spirit is meant to reveal the believer’s strengths and weaknesses. It is in solitude that God is able to speak to the heart of the individual as a father would instruct his child. It is meant to be a time of sacrificial giving to the Father, by giving Him undivided attention. This time should be spent in prayer, reading, and personal evaluation. For all of these reasons, we should each take the time to craft a time and place for this kind of solitude, for in it we can find healing, strength, maturity, and growth.","categories":["Articles"],"author":["rec8A0tWhaGdNqO50"],"date_added":"2014-08-04","published":true,"author_name":["Pastor David Bousquet"],"author_thumbnail":[{"id":"attZ5clmn6QhITAYD","url":"https://dl.airtable.com/BaLMuRfQbK5QHvVgntv1_bousquet.jpg","filename":"bousquet.jpg","type":"image/jpeg","size":12302,"width":256,"height":256,"smallThumbUrl":"https://dl.airtable.com/HitcmenQxewc3cpUKqma_small_bousquet.jpg","smallThumbWidth":36,"smallThumbHeight":36,"largeThumbUrl":"https://dl.airtable.com/wXcRpTUQ5izHDk7fIVoD_large_bousquet.jpg","largeThumbWidth":256,"largeThumbHeight":256}],"ten_minutes":0,"updated_or_created_ten_minutes":0},{"title":"A Model for Mentorship","body_content":"There are several different models or philosophies which are used to lead or pastor a church. The typical church has a pastor who teaches or preaches, but has very little individual interaction with members of the congregation. There are several reasons for this style of pastorship. Primarily there is the time reason, it takes a great deal of time to answer the questions of individuals. Secondarily it requires the pastor to be open to discussions which may disagree with his own beliefs. Many times, pastors possess a “my way or the highway” mentality, which cripples mentorship. Thirdly the typical style of pastoring possesses little creativity. In individual discipleship or mentorship requires that the pastor creatively works with the individual to tailor theology to meet his needs.\n\nThe biblical model instructed by Paul and demonstrated by Christ was that of mentorship. Paul told Timothy to find other men, and then teach them so that they could teach others. Christ mentored the apostles in their faith, demonstrating creativity, time, and concern for the individual. A mentor model is the better model for several reasons. First, it is the biblical model. This really requires little explanation, for if it was the model followed by Christ and Paul, then it should be the one followed by us today. Second, it demonstrates concern for the individual within the church, and not just the number of people who attend. It is easy to become focused on numbers and to ignore the need of individuals. Third, it challenges the pastor to constantly evaluate what he believes, and it forces him to be in constant study in order to meet the needs of the individuals he is mentoring. Fourth, it builds the individual into a better representation of Christ, by sharpening and encouraging each other.","categories":["Articles"],"author":["rec8A0tWhaGdNqO50"],"date_added":"2014-07-23","published":true,"author_name":["Pastor David Bousquet"],"author_thumbnail":[{"id":"attZ5clmn6QhITAYD","url":"https://dl.airtable.com/BaLMuRfQbK5QHvVgntv1_bousquet.jpg","filename":"bousquet.jpg","type":"image/jpeg","size":12302,"width":256,"height":256,"smallThumbUrl":"https://dl.airtable.com/HitcmenQxewc3cpUKqma_small_bousquet.jpg","smallThumbWidth":36,"smallThumbHeight":36,"largeThumbUrl":"https://dl.airtable.com/wXcRpTUQ5izHDk7fIVoD_large_bousquet.jpg","largeThumbWidth":256,"largeThumbHeight":256}],"ten_minutes":0,"updated_or_created_ten_minutes":0},{"title":"Independence","body_content":"Romans 6:18 says, “Being then made free from sin, ye became the servants of righteousness.” It is important for us all to realize three wonderful truths from the verse today.\n\nFirst, through Christ we have been given freedom. I Corinthians 15 states that we have attained unto victory through the death of Christ. The price of true freedom is always death. As such, Christ paid the ultimate price for us to achieve the ultimate freedom.\n\nSecond, we are freed from sin. It is not only important to realize that we have been freed, but also to realize what we have been freed from. Sin no longer is our master or owner. We have been freed from our slavery, and as such we should rejoice and run from all forms of service to our former master. This means that we should rejoice over freedom, and that we should cling to our Emancipator.\n\nFinally, we need to realize what we have been freed to. Being made free from sin, we then are expected to become the servants of righteousness. It is reasonable that we should dedicate the remaining years of our lives to He who freed us from our slavery. True this results in a new form of “slavery”, however the master is very different as is the service that is expected. Before our freedom we could not do anything righteous, but now we are covered by the holiness of God and are able to share His righteousness with others. Our works now are supposed to serve as a testament to the love of our new Master, and as such provide freedom to others who are still trapped in their slavery to sin.","categories":["Articles"],"author":["rec8A0tWhaGdNqO50"],"date_added":"2014-07-04","published":true,"author_name":["Pastor David Bousquet"],"author_thumbnail":[{"id":"attZ5clmn6QhITAYD","url":"https://dl.airtable.com/BaLMuRfQbK5QHvVgntv1_bousquet.jpg","filename":"bousquet.jpg","type":"image/jpeg","size":12302,"width":256,"height":256,"smallThumbUrl":"https://dl.airtable.com/HitcmenQxewc3cpUKqma_small_bousquet.jpg","smallThumbWidth":36,"smallThumbHeight":36,"largeThumbUrl":"https://dl.airtable.com/wXcRpTUQ5izHDk7fIVoD_large_bousquet.jpg","largeThumbWidth":256,"largeThumbHeight":256}],"ten_minutes":0,"updated_or_created_ten_minutes":0},{"title":"Grace Given Should Be Grace Returned","body_content":"Grace is a wonderful gift from God. The simplest definition is that grace is getting something that the individual does not deserve, and as such cannot be earned or purchased. Romans points out that if grace is earned then it is no longer grace, in addition, Galatians points out that faith is required to acquire grace and that works have no part of God’s grace.\n\nWhat is neglected is the responsibility of each believer to live according to grace, and as such return the gift of grace to God by extending grace to others. Think about grace like a gift that is best when shared with others. When others are able to enjoy it, the giver is then given the great blessing of seeing others enjoy it. This is a return, not in the aspect of giving the grace back, but instead of a return like an investment. This gift grows like an investment, which is meant to be used for the benefit of others.\n\nGrace can be shared in several ways. First, it is extended when the believer gives forgiveness to others. This helps to prevent resentment and bitterness which will quickly destroy relationships. Second, it is given when the believer commits acts of kindness to others. Just as forgiveness is not based upon the offenders right, but upon Christ’s righteousness, so also kindness to others is not based upon the others actions, but upon Christ’s actions. This is important, for these open the door to the last expression of grace: salvation. The final way that grace is returned is when the individual believer is able to share the gospel with others. This allows grace to grow as the kingdom of God also grows.\n\nLet us each be conduits of God’s grace through having first received His grace and then by living according to that precious Grace!","categories":["Articles"],"author":["rec8A0tWhaGdNqO50"],"date_added":"2014-06-11","published":true,"author_name":["Pastor David Bousquet"],"author_thumbnail":[{"id":"attZ5clmn6QhITAYD","url":"https://dl.airtable.com/BaLMuRfQbK5QHvVgntv1_bousquet.jpg","filename":"bousquet.jpg","type":"image/jpeg","size":12302,"width":256,"height":256,"smallThumbUrl":"https://dl.airtable.com/HitcmenQxewc3cpUKqma_small_bousquet.jpg","smallThumbWidth":36,"smallThumbHeight":36,"largeThumbUrl":"https://dl.airtable.com/wXcRpTUQ5izHDk7fIVoD_large_bousquet.jpg","largeThumbWidth":256,"largeThumbHeight":256}],"ten_minutes":0,"updated_or_created_ten_minutes":0},{"title":"An Apologetic of Hope","body_content":"I Peter 3:15 says “But sanctify the Lord God in your hearts: and be ready always to give an answer to every man that asketh you a reason of the hope that is in you with meekness and fear:”. This verse lays the foundation for the method and proper use of apologetics within the life of each believer.\n\nThe first element found is that the believer is to sanctify the Lord in the heart. To sanctify is to make holy or to prove the holiness of another. In this case it is saying that the believer is to prove or apply the holiness of God internally by separating himself from sin. Once he has done this he should naturally begin to live out his faith in an obvious way, which will then be noticed by those with whom he comes in contact.\n\nThe second element is found in being ready to give an answer for his hope. In other words, he is to live his life so that others can see that he possesses hope at all times. There is no shortage of sorrow or despair, which makes the believer’s hope all the more valuable . This kind of a life should lead to being asked the reason for hope. Hopefulness is so rare, that it will be noticed. Never leave home without it.\n\nThe final element is found in the command to give one’s answer with meekness and fear. Too often the apparent emotion or attitude associate with defending one’s faith is arrogance or pride, when it should humility and fear. Fear is a great motivator. It can either paralyze or propel the individual to action. When it comes to presenting Christ it ought to be fuel for evangelism, but it should also bring caution. Fear keeps the believer from overstepping and allows the Holy Spirit to move thus bringing true repentance. In addition, meekness is humility in service to another. This humility is a precious commodity. It seeks to serve the other without reward or gain. It’s only hope is to see the asker be brought to a place of safety in relationship to God. Meekness protects the message from being hijacked by the believer’s pride, because it realizes that without the grace of God salvation would be impossible.\n\nThese three elements are truly the key to a vibrant apologetic, which if employed will reap great benefits for the kingdom of God. In addition, it will help to create a new generation of humble servants for Christ.","categories":["Articles"],"author":["rec8A0tWhaGdNqO50"],"date_added":"2014-05-28","published":true,"author_name":["Pastor David Bousquet"],"author_thumbnail":[{"id":"attZ5clmn6QhITAYD","url":"https://dl.airtable.com/BaLMuRfQbK5QHvVgntv1_bousquet.jpg","filename":"bousquet.jpg","type":"image/jpeg","size":12302,"width":256,"height":256,"smallThumbUrl":"https://dl.airtable.com/HitcmenQxewc3cpUKqma_small_bousquet.jpg","smallThumbWidth":36,"smallThumbHeight":36,"largeThumbUrl":"https://dl.airtable.com/wXcRpTUQ5izHDk7fIVoD_large_bousquet.jpg","largeThumbWidth":256,"largeThumbHeight":256}],"ten_minutes":0,"updated_or_created_ten_minutes":0},{"title":"Well the Bible Says","body_content":"Many times in my life I have heard individuals, both pastors and lay believers, use the phrase “the Bible plainly or clearly says…” in order to prove or defend a personal standard or conviction. I often find this very frustrating and very interesting, because many times they are able to pick a verse or even a couple of verses to seemingly prove their point. The problem is that many times those verses are being taken out of context.\n\nContext is perhaps the most important element to remember when determining what any verse is saying. In order to understand the context, one needs to take the time to understand the theme of the book in which the passage resides, the audience that received the initial passage, and the grammatical structure of the passage. These are just a few of the keys to determining context, but they provide the foundation for understanding. In addition, it should be remembered that the Bible will never mean something now that It didn’t mean to the original audience.\n\nWe all need to be certain that before we say “Well the Bible says…” we take the time to first actually determine what it is saying. We need to do this for several reasons. First, it will protect the integrity of the Word of God. Few things undermine the actual authority of God’s Word then believers taking It out of context. Second, it will protect the testimony of Christ. When individuals take the Word out of context they often do so to promote their own opinions or to cement control over others. This destroys the authority of Christ in our lives. Third, it opens the door real Biblical understanding. Biblical understanding is essential to growing in faith and maturity. Both of these are crippled when the Word is not contextually taught or studied. Finally, it ensures a proper foundation. When context is present, the individual can point to the Word as the standard for faith lived out in our daily lives.","categories":["Articles"],"author":["rec8A0tWhaGdNqO50"],"date_added":"2014-05-14","published":true,"author_name":["Pastor David Bousquet"],"author_thumbnail":[{"id":"attZ5clmn6QhITAYD","url":"https://dl.airtable.com/BaLMuRfQbK5QHvVgntv1_bousquet.jpg","filename":"bousquet.jpg","type":"image/jpeg","size":12302,"width":256,"height":256,"smallThumbUrl":"https://dl.airtable.com/HitcmenQxewc3cpUKqma_small_bousquet.jpg","smallThumbWidth":36,"smallThumbHeight":36,"largeThumbUrl":"https://dl.airtable.com/wXcRpTUQ5izHDk7fIVoD_large_bousquet.jpg","largeThumbWidth":256,"largeThumbHeight":256}],"ten_minutes":0,"updated_or_created_ten_minutes":0},{"title":"Truth's From the Lord's Prayer","body_content":"Tomorrow’s sermon will focus on Christ’s teachings within the Lord’s Prayer. It is interesting that this relatively brief prayer has been memorized and recited by Christian’s for almost two thousand years, and yet the truths that were taught have been almost entirely ignored in the modern church.\n\nWithin the simple prayer one can see submission, provision, protection, sovereignty, and power. Truly each believer should learn to recognize these truths, and then apply them to his daily life. There is no substitute for surrender and dependence within the Christian life, yet we often forfeit those elements in order to focus on our own selfish desires. As we focus on His prayer, we should also learn to focus on His will.","categories":["Articles"],"author":["rec8A0tWhaGdNqO50"],"date_added":"2014-05-10","published":true,"author_name":["Pastor David Bousquet"],"author_thumbnail":[{"id":"attZ5clmn6QhITAYD","url":"https://dl.airtable.com/BaLMuRfQbK5QHvVgntv1_bousquet.jpg","filename":"bousquet.jpg","type":"image/jpeg","size":12302,"width":256,"height":256,"smallThumbUrl":"https://dl.airtable.com/HitcmenQxewc3cpUKqma_small_bousquet.jpg","smallThumbWidth":36,"smallThumbHeight":36,"largeThumbUrl":"https://dl.airtable.com/wXcRpTUQ5izHDk7fIVoD_large_bousquet.jpg","largeThumbWidth":256,"largeThumbHeight":256}],"ten_minutes":0,"updated_or_created_ten_minutes":0},{"title":"Worship in Practice","body_content":"Recently I was asked a question about how the believer is able to give glory to God in the midst of recreational activities. I told him that it could be as simple as not reacting negatively to a bad shot or being genuinely thankful for a good one. In addition, one can give glory be expressing thankfulness for the opportunity to partake in the activity. Too often we become so focused on our activity that we fail to praise God for the ability to enjoy that activity. Ephesians 5:20 tells us to always be thankful for all things. This is not easy, but it is the foundation for living in a state of worship.\n\nWorship can be broken into three different types or forms. The first form is formal or corporate worship. This occurs in a formal assembly of like believers, who have gathered for the express purpose of singing, praising, and learning. The focus is to be on the holiness of God and grounded on His Word. The second is informal or personal worship. This occurs outside of the church, and is experienced when the individual takes time to focus on studying the Word of God and praying. This is a time of personal focused worship, which may or may not include singing and family instruction. The final form of worship is dynamic worship. This is accomplished when the individual is able to split his focus between the various activities he is participating in and actively worshiping God through his words and actions. Of the three this final is the hardest to actually fulfill. This is due to our ability to focus on a task or pleasure to the complete exclusion of anything else. Being selfish individuals we have the tendency to ignore the God who made pleasure we are in the act of enjoying.\n\nImagine worship as an automobile. Formal worship is the engine. It provides teaching, praise, instruction, and encouragement which is meant to energize the individual. Informal worship is the transmission which is meant to propel the individual into service, because it provides personal learning and maturity. However, the transmission and the engine need a clutch to allow the two to mesh and be useful. This clutch is dynamic worship. Dynamic worship requires that the individual seek to apply what he has learned to his everyday life. Worship is meant to be both centrally focused and split focused, because each believer is expected to use each moment as a form of worship to God.","categories":["Articles"],"author":["rec8A0tWhaGdNqO50"],"date_added":"2014-04-30","published":true,"author_name":["Pastor David Bousquet"],"author_thumbnail":[{"id":"attZ5clmn6QhITAYD","url":"https://dl.airtable.com/BaLMuRfQbK5QHvVgntv1_bousquet.jpg","filename":"bousquet.jpg","type":"image/jpeg","size":12302,"width":256,"height":256,"smallThumbUrl":"https://dl.airtable.com/HitcmenQxewc3cpUKqma_small_bousquet.jpg","smallThumbWidth":36,"smallThumbHeight":36,"largeThumbUrl":"https://dl.airtable.com/wXcRpTUQ5izHDk7fIVoD_large_bousquet.jpg","largeThumbWidth":256,"largeThumbHeight":256}],"ten_minutes":0,"updated_or_created_ten_minutes":0},{"title":"A Brief Explanation","body_content":"Recently I was asked to put into words the unique relationship between sovereignty and freewill. Here was the result.\n\nThere are several important things to realize concerning predestination, election, freewill, sovereignty, and salvation.\n\nFirst, the Bible clearly states that God is omniscient, which means that He knows everything. In regard to salvation, this means that God knew before time began who would choose Him and who would not. Thus His predetermination was not based upon any random whim, but instead on His knowledge of how the individual would choose. Please carefully read Romans 8:29-30. In these verses, the election of God is determined by the foreknowledge of God. Since the calling and all aspects of sanctification stem from the foreknowledge of God, it is safe to say that the overwhelming characteristic of His election is not predestination, but foreknowledge.\n\nSecond, not only does the Bible clearly teach that God foreknew who would come to Him and thus prepared salvation for them, but it also reveals that every man has the choice and freedom to do so. This may seem contradictory, but it is not. These two work together to accomplish the greatest personal miracle ever: salvation. John 1:12 reveals that only those who receive Christ are made the sons of God. The word receive means to voluntary accept. Thus it is the individual’s responsibility to either accept or reject. This is even seen in the word “called.” Some say that this means that God will only send the Holy Spirit to draw some to salvation, when in actuality it refers to those who answered the call. Romans 1 reveals that God has used several methods to try to call the hearts of mankind, but only those who answered were able to receive His message.\n\nFinally, the freewill of man and the sovereignty of God were clearly established in the Garden, and are seen in the very position that God gave to man. When God created man, He made him in His own image. Thus man is a reflection of the characteristics, position, and sovereignty of God. God has given man all of His attributes in a limited form. God is everywhere, man is somewhere. God knows all things, man knows some things. God is the Sovereign of Heaven and Earth, but He made man to be a limited sovereign in charge of the earth. When He did that, He gave man freewill to rule and to govern the earth within the boundaries that He had set. Thus man was meant to worship God through voluntarily recognizing His sovereignty by living within God’s boundaries. Man failed and as a result all are born sinners. If one were to look at the curse in Gen. 3 one would see that God never stripped man of his position, but instead revealed that he would now have to battle with creation for his very existence. As man had rebelled against the rule of God, so also nature was now free to rebel against man’s rule. It should be noted that never in the judgment that God passed on Adam did He declare that freewill or sovereignty had been removed. Just as Adam retained his freewill, so also has each since Adam. Each is still intended to be a limited sovereign under the authority of God, ruling and living within His boundaries.\n\nThere is a great deal that could be added to this explanation, but I trust that it will suffice as a brief synopsis.\n\n","categories":["Articles"],"author":["rec8A0tWhaGdNqO50","reczPs9UYkD4W8g2z"],"date_added":"2014-04-23","published":true,"author_name":["Pastor David Bousquet"],"author_thumbnail":[{"id":"attZ5clmn6QhITAYD","url":"https://dl.airtable.com/BaLMuRfQbK5QHvVgntv1_bousquet.jpg","filename":"bousquet.jpg","type":"image/jpeg","size":12302,"width":256,"height":256,"smallThumbUrl":"https://dl.airtable.com/HitcmenQxewc3cpUKqma_small_bousquet.jpg","smallThumbWidth":36,"smallThumbHeight":36,"largeThumbUrl":"https://dl.airtable.com/wXcRpTUQ5izHDk7fIVoD_large_bousquet.jpg","largeThumbWidth":256,"largeThumbHeight":256}],"ten_minutes":0,"updated_or_created_ten_minutes":0}]
